#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Мама', 'Папа', 'Сестра', 'Бабушка', 'Тётя']


# список списков приблизителного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    ['Мама', 165],
    ['Папа', 187],
    ['Сестра', 159],
    ['Бабушка', 152],
    ['Тётя', 162]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

print('Рост отца -', my_family_height[1][1], 'см')

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см

sum_heights = my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1] +\
              my_family_height[3][1] + my_family_height[4][1]
print('Общий рост моей семьи -', sum_heights, 'см')